{
    "data": [{
            "Id": 1,
            "Scope": "Domestic",
            "Type": "Journal",
            "Title": "Thuật toán cân bằng tải nhằm giảm thời gian đáp ứng dựa vào ngưỡng thời gian trên điện toán đám mây",
            "CoAuthors": "Trần Công Hùng, Nguyễn Xuân Phi",
            "Day": null,
            "Month": 12,
            "Year": 2018,
            "City": "Hà Nội City",
            "Publisher": "Journal on Information and Communications",
            "PublisherUrl": "http://ictvietnam.vn/",
            "Pages": "43-48",
            "Doi": null,
            "Issn": "2525-2224",
            "Isbn": null,
            "IndexedBy": "Hội đồng GSNN",
            "DownloadUrl": "assets/teacher/ReasearchWork/1.pdf",
            "RefUrl": null,
            "Abstract": null,
            "Keywords": "Cân bằng tải, điện toán đám mây, thời gian đáp ứng, thời gian đáp ứng dự báo",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 2,
            "Scope": "International",
            "Type": "Conference",
            "Title": "MMSIA: Improved Max-Min Scheduling Algorithm for Load\nBalancing on Cloud Computing",
            "CoAuthors": "Tran Cong Hung, Phan Thanh Hy, Nguyen Xuan Phi",
            "Day": "25",
            "Month": 1,
            "Year": 2019,
            "City": "Đà Lạt City",
            "Publisher": "ICMLSC 2019",
            "PublisherUrl": "http://www.icmlsc.org/",
            "Pages": null,
            "Doi": "https://doi.org/10.1145/3310986.3311017",
            "Issn": null,
            "Isbn": "9.78145E+12",
            "IndexedBy": "Scopus",
            "DownloadUrl": "assets/teacher/ReasearchWork/2.pdf",
            "RefUrl": null,
            "Abstract": "Cloud computing is one of the most advanced technologies in\ninformation technology, a convergence of many achievements in\nresearch and development and application of new technologies.\nCloud computing has also helped to reduce the cost of small and\nmedium enterprises based on cloud provider services. As cloud\ncomputing evolves rapidly, researching optimizations such as task\nexecution time, completion time, responce time, and virtual\nmachine resources (VMs) are tremendous challenges. This article\nproposes an MMSIA algorithm to improve the Max-Min\nscheduling algorithm, which improves the completion time of the\nrequests by using the \"learned learning\" machine learning, by\nclustering size of requests and clustering utilization percent of\nVMs. The algorithm then assigns the largest cluster requests to the\nVM with the least utilization percent, which is repeated when the\nrequest list is empty. In particular, the MMSIA algorithm has\nimproved the completion time. The simulation results show that\nthe proposed MMSIA algorithm has improved the completion\ntime compared to the three algorithms: Max-Min, Min-Min and\nRoud Robin",
            "Keywords": "Max – Min, load balancing, improve Max – Min algorithm,\ncomple, processing time",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 3,
            "Scope": "International",
            "Type": "Conference",
            "Title": "A MOVING DIRECTION PROPOSAL TO SAVE\nENERGY CONSUMPTION FOR MOBILE SINK\nIN WIRELESS SENSOR NETWORK",
            "CoAuthors": "Tran Cong Hung, Dang Thi Ngoc, Phan Thi The, Luan N.T. Huynh, Le Dien Tam",
            "Day": "17",
            "Month": 2,
            "Year": 2019,
            "City": "Phoenix Park, PyeongChang, Korea",
            "Publisher": "ICACT 2019",
            "PublisherUrl": "http://www.icact.org/",
            "Pages": null,
            "Doi": "https://doi.org/10.23919/icact.2019.8701971",
            "Issn": null,
            "Isbn": "9.79119E+12",
            "IndexedBy": "Scopus, IEEE",
            "DownloadUrl": "assets/teacher/ReasearchWork/3.pdf",
            "RefUrl": null,
            "Abstract": "Wireless sensor network is useful for human that\nattract more scientists although they are still limited and limited\nenergy is a weakness of wireless sensor that make getting\ninformation is interrupted. To improve energy consumption in\nWSN, in this paper we show a routing algorithm combined of\nLEACH_C and Dijkstra algorithm. A mobile sink move from\nBase Station (BS) to the Cluster Head (CHs) to get data, the\ndirection of mobile sink is decided by Dijkstra algorithm. An\nefficient is saving energy and expand alive time of the sensor\nnetwork.",
            "Keywords": "LEACH-C, Mobile sink, Dijkstra, Cluster Head",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 4,
            "Scope": "International",
            "Type": "Conference",
            "Title": "ACTIVE MOBILE CHINESE, A NEW APPROACH IN LEARNING CHINESE AS A FOREIGN LANGUAGE",
            "CoAuthors": "Tran Khai Xuan",
            "Day": "11",
            "Month": 11,
            "Year": 2019,
            "City": "Seville (Spain)",
            "Publisher": "ICERI2019 Proceedings",
            "PublisherUrl": "https://iated.org/iceri/",
            "Pages": null,
            "Doi": "https://doi.org/10.21125/iceri.2019.0770",
            "Issn": null,
            "Isbn": "9.78841E+12",
            "IndexedBy": "ISI, Web of Science",
            "DownloadUrl": "assets/teacher/ReasearchWork/4.pdf",
            "RefUrl": null,
            "Abstract": "Looking at the recent data of the Chinese economy growth and the amount of Chinese companies and tourism, we can see the big grow of Chinese and its influences. That is the reason why learning Mandarin Chinese is rapidly developing nowadays and it becomes one of the most popular languages in the world. Due to the expanding of Chinese and users’ demand in over the world, teaching Chinese as foreign language is a very necessary mission in Chinese Language Studies. In the past few decades, there are a lot of traditional studies and researches how to teach Chinese as foreign language in around the world, especially speaking English areas. The aim of this paper is to critically analyse a few new methodologies of learning and teaching Chinese recently, to generate those researches’ result to propose a new approach of teaching Chinese as foreign language. This approach, called “Active Mobile Chinese”, is illustrated by using mobile learning method to create a new learning environment for Chinese learners. With this new idea, we can bring the Chinese language to learners anywhere and anytime. Due to the flexibility of mobile learning style, we would propose the content of this method is more on vocabulary: common words and expressions. This seems to be very active because the languages are very common and can be used in daily lives of the society. Our new approach focuses on using the sense of language that learners can easily absorb how to use Chinese with very common words, characters and even expressions. With this language sense, people can slowly grasp and understand Chinese grammar rules. We can do the adjustment for every culture based on this core approach",
            "Keywords": "Active Mobile Chinese, Mobile Learning Style, Chinese for Foreigner, Learning Chinese, Teaching Chinese as a foreign language",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 5,
            "Scope": "International",
            "Type": "Conference",
            "Title": "THE NEW “CONNECTING MODEL” IN UNDERGRADUATE EDUCATION",
            "CoAuthors": "Truong Doan Viet",
            "Day": "11",
            "Month": 11,
            "Year": 2019,
            "City": "Seville (Spain)",
            "Publisher": "ICERI2019 Proceedings",
            "PublisherUrl": "https://iated.org/iceri/",
            "Pages": null,
            "Doi": "https://doi.org/10.21125/iceri.2019.0771",
            "Issn": null,
            "Isbn": "9.78841E+12",
            "IndexedBy": "ISI, Web of Science",
            "DownloadUrl": "assets/teacher/ReasearchWork/5.pdf",
            "RefUrl": null,
            "Abstract": "The linkages between schools and enterprises are becoming the most important means of undergraduate education outcome. Universities always stand in need of coordinating with employers to help themselves catch the demand of market on the labor force. On the other hand, it is good news for enterprises if there is a training agent that can provide labors who can meet their demand. There was a lot of reliable evidence to show that students, teachers, parents, business, schools as a whole and the wider community can all benefit from school–business partnerships.\nThe Industry 4.0 is an indispensable technology trend that Vietnam must aim to catch up with developed countries in the world with intelligent technologies such as artificial intelligence, Internet, automation, technology of 3D printing. Therefore, the demand of quantity and quality human resources in information technology is quite enormously. In this article, we propose a new “connecting model” in undergraduate education to make a closer coordination between enterprises and universities. That is, businesses and enterprises will be directly involved in teaching and training in the course of the school. Content such as training syllabus, assessment process, facilities, teaching staff that are decided by the related businesses. Those solutions relate to universities, enterprises and the labor market as well.\n",
            "Keywords": "linkages in education, connecting model, training link model, undergraduate education",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 6,
            "Scope": "Domestic",
            "Type": "Journal",
            "Title": "PHÁT TRIỂN CHƯƠNG TRÌNH MÔN HỌC TÍNH TOÁN DI ĐỘNG VÀ INTERNET (MOBILE COMPUTING & INTERNET) THEO TIẾP CẬN CDIO TẠI TRƯỜNG ĐẠI HỌC MỞ THÀNH PHỐ HỒ CHÍ MINH.",
            "CoAuthors": "Nguyễn Phước Lâm",
            "Day": null,
            "Month": 1,
            "Year": 2020,
            "City": "TP.HCM",
            "Publisher": "Tạp chí khoa học Đại học Sài Gòn",
            "PublisherUrl": "https://tapchikhoahoc.sgu.edu.vn/",
            "Pages": null,
            "Doi": null,
            "Issn": null,
            "Isbn": null,
            "IndexedBy": "Hội đồng GSNN",
            "DownloadUrl": "assets/teacher/ReasearchWork/6.pdf",
            "RefUrl": null,
            "Abstract": "The program curriculum of Information Technology at HCMC Open University has been built and developed by the social demands, integrated mostly applicable skills. Therefore, this program has been come out by the demands of society and technologies. According CDIO approach, the learning outcome of a program must adapt the position demands from the society. One of the technology’s demands is Mobile Computing and Internet. Mobile computing and Internet is a subject which overviews about the mobile technologies and the career skills respectively, and it also provisions more knowledges about the internet and its relevant tech. With the knowledges, skills and good attitudes about Mobile Computing & Internet, this subject will help the students be more skillful and adapt the requires from current technologies, especially the students can independently study and research more about the field of Mobile Computing & Internet in order to have a better performance in working",
            "Keywords": "Syllabus development; CDIO; Mobile computing and Internet; ",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 7,
            "Scope": "International",
            "Type": "Conference",
            "Title": "Early Phase Warning Solution About System Security Based on Log Analysis",
            "CoAuthors": "Tran Cong Hung, Nguyen Duc Huy, Nguyen Thi Thanh Hang",
            "Day": "11",
            "Month": 12,
            "Year": 2019,
            "City": "Hà Nội City",
            "Publisher": "NICS 2019",
            "PublisherUrl": "http://nafosted-nics.org/",
            "Pages": null,
            "Doi": null,
            "Issn": null,
            "Isbn": null,
            "IndexedBy": "Scopus, IEEE",
            "DownloadUrl": "assets/teacher/ReasearchWork/7.pdf",
            "RefUrl": null,
            "Abstract": "Nowadays when the technology develops day by day, safety information and security system have become one of the biggest issues that many people are concerned about and research in order to find solutions to ensure the security of information systems. At present, the most important thing that network administrators care about is minimizing the damage to the enterprises when cyber security crimes invade the information system or attack the system anytime. Therefore, how they can proactively protect information, ensure the privacy of users, how to improve the confidentiality and security of information in business system. To solve the problem above, the research \"Early warning solution about system security based on log analysis\" is extremely necessary, because it can help to warn and detect early-attacking information when there are abnormal signs in systems via logs. By inheriting the advantages, as well as overcoming the limitations of those previous related topics in the world, in this paper, we would like to develop and to build an early warning application tool capable of interacting, monitoring, adjusting, notifying from the scouting process of the attackers. The new proposed system in this research is based on the characteristics of attack techniques, components and packets through the system, we design a data collection model of Logs input and output. In order to detect and explore abnormal activities in network which are harmful for information systems, we use the log analysis of the information system with the method of analyzing APT target. We study the APT and its characteristic to build the knowledge that we can use an advanced AI algorithm, Deep & Wide Learning algorithm. With logs testing data we conducted in our LAN, we have reached some good results showed the potential of our proposals.  ",
            "Keywords": "Network security; Advanced Persistent Threat – APT; Early warning solutions; Log analysis; Artificial Intelligence (AI); Deep - Wide Learning",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        },
        {
            "Id": 8,
            "Scope": "International",
            "Type": "Conference",
            "Title": "Developing the New Proposal of Intelligence System in Heart and Cardiovascular Diagnosis",
            "CoAuthors": "Tran Cong Hung, Do Phuoc Sang, Bui Dan Khue",
            "Day": "11",
            "Month": 12,
            "Year": 2019,
            "City": "Hà Nội City",
            "Publisher": "NICS 2019",
            "PublisherUrl": "http://nafosted-nics.org/",
            "Pages": null,
            "Doi": null,
            "Issn": null,
            "Isbn": null,
            "IndexedBy": "Scopus, IEEE",
            "DownloadUrl": "assets/teacher/ReasearchWork/8.pdf",
            "RefUrl": null,
            "Abstract": "The World Health Organization estimates that annually, there are 17.5 million deaths due to cardiovascular-related diseases and the number of patients accumulates. This study aims to apply some AI technologies to the system of cardiovascular diagnosis, to provide a solution for building information channels so that people have an overview of cardiovascular pathology. With this approach, people can have self-diagnosis, classification of cardiovascular pathology and know how to plan the examination and treatment to achieve better outcomes. In this paper, the system is built by using reasoning algorithm combined with supervised learning to carry the diagnosis process through the collection of symptoms. The study was experimented on data collected directly from the medical records at General Hospital of Binh Duong Province, and the experimental results show that the accuracy of diagnosis is over 75% compared to the actual diagnostic results.",
            "Keywords": "Cardiovascular diagnosis, Expert system, Supervised Learning, Diagnosis of the disease, Artificial intelligence",
            "ViewGroup": 1,
            "Status": 1,
            "CreatedBy": 1,
            "CreatedOn": "00:00.0",
            "ModifiedBy": null,
            "ModifiedOn": null
        }
    ]
}